ansible_cucm/cucmv2/roles/CUCM_axl_setup/files/AxlCmds/AXL_addTransPattern_block.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.cisco.com/AXL/API/11.5">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:addTransPattern sequence="?">
         <transPattern>
            <pattern>9[0-3].!</pattern>
            <description>MLPP Restricted</description>
            <usage>Translation</usage>
            <routePartitionName uuid="?">MLPP_Restricted_PT</routePartitionName>
            <provideOutsideDialtone>true</provideOutsideDialtone>
            <patternUrgency>true</patternUrgency>
            <patternPrecedence>Default</patternPrecedence>
			<blockEnable>true</blockEnable>
            <releaseClause>Precedence Level Exceeded</releaseClause>
         </transPattern>
      </ns:addTransPattern>
   </soapenv:Body>
</soapenv:Envelope>